# End Treatment Type Create(Document, String) Method

Source: https://www.revitapidocs.com/2026/75a20905-c88b-df7e-1adc-d6beb096bec9.htm

---

| End Treatment Type Create(Document, String) Method |
| --- |

Creates a new EndTreatmentType in the specified document and adds the input string to the endTreatment parameter.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static EndTreatmentType Create(
	Document doc,
	string treatment
)
```

```
Public Shared Function Create (
	doc As Document,
	treatment As String
) As EndTreatmentType
```

```
public:
static EndTreatmentType^ Create(
	Document^ doc,
	String^ treatment
)
```

```
static member Create :
        doc : Document *
        treatment : string -> EndTreatmentType
```

#### Parameters

doc Document
:   Returns the newly created EndTreatmentType in the specified document.

treatment String
:   This string will be se to the endTreatment parameter.

#### Return Value

EndTreatmentType
Returns the newly created EndTreatmentType in the specified document. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

EndTreatmentType Class Create Overload Autodesk.Revit.DB.Structure Namespace